93lucasp/w05d02/app/controllers/records_controller.rb

SELECT "records".* FROM "records"
---
  def index
  @records = Record.all

SELECT  "records".* FROM "records" WHERE "records"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @record = Record.find(params[:id])

INSERT INTO "records" ("title", "artist", "year", "cover_art", "song_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    Record.create(record_params)