techbender-leslie/bog_app_final/app/controllers/creatures_controller.rb

def create
  creature_params = params.require(:creature).permit(:name, :description)

  creature = Creature.new(creature_params)

  if creature.save
---
INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Hans Solo"], ["description", "Freelancer"], ["created_at", "2016-02-19 02:09:31.545627"], ["updated_at", "2016-02-19 02:09:31.545627"]]

def show
  id = params[:id]

  @creature = Creature.find(id)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 4]]

def edit
  id = params[:id]
  @creature = Creature.find(id)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]

def update
  # save the id paramater from the url
  creature_id = params[:id]
  # find the creature to update by id
  creature = Creature.find(creature_id)

  # get updated creature data from params
  updated_attributes = params.require(:creature).permit(:name, :description)

  # update the creature
  creature.update_attributes(updated_attributes)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "creatures" SET "description" = $1, "updated_at" = $2 WHERE "creatures"."id" = $3  [["description", "Little green master guy"], ["updated_at", "2016-02-19 02:27:26.578058"], ["id", 1]]

def destroy
  id = params[:id]

  creature = Creature.find(id)
  creature.destroy
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 4]]