FranchiniMae/w05/w05d04/lib_app/app/controllers/libraries_controller.rb

SELECT "libraries".* FROM "libraries"
---
	def index
		@libraries = Library.all

INSERT INTO "libraries" ("name", "floor_count", "floor_area", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "LBPL"], ["floor_count", 1], ["floor_area", 1], ["created_at", "2016-02-21 05:24:37.600986"], ["updated_at", "2016-02-21 05:24:37.600986"]]
---
	def create
		@library = Library.create(library_params)

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		@library = Library.find(params[:id])

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 1]]
---
	def edit
		@library = Library.find(params[:id])