nreddy216/w05d04/bog_app/app/controllers/creatures_controller.rb

SELECT "creatures".* FROM "creatures"
---
  def index
    #get all creatures from DB and save to instance variable
    @creatures = Creature.all

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "dsfdsf"], ["description", "dsfdsf"], ["created_at", "2016-02-19 01:25:54.999019"], ["updated_at", "2016-02-19 01:25:54.999019"]]
---
  def create
    # validate params and save them as a variable
    creature_params = params.require(:creature).permit(:name, :description)

    #create a new creature with those params
    creature = Creature.new(creature_params)

    #check that it saved
    if creature.save

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 6]]
---
  def show
    #get the id parameter from the url
    id = params[:id]
    #find the creature with that id and save to an instance variable
    @creature = Creature.find(id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 6]]
---
  def edit
    #save the id parameter to a variable
    id = params[:id]
    #look up the creature by id and save to an instance variable
    @creature = Creature.find(id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "creatures" SET "description" = $1, "updated_at" = $2 WHERE "creatures"."id" = $3  [["description", "Green little man!!!!"], ["updated_at", "2016-02-19 01:46:57.307549"], ["id", 1]]
---
  def update
    # save the id parameter from the url
    creature_id = params[:id]
    #find the creature to update by id
    creature = Creature.find(creature_id)

    #get updated creature data from params
    updated_attributes = params.require(:creature).permit(:name, :description)
    #update the creature
    creature.update_attributes(updated_attributes)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 5]]
---
  def destroy
    #save the id parameter
    id = params[:id]
    #find the creature to delete by id
    creature = Creature.find(id)
    #destroy the creature
    creature.destroy