dChiamp/w05d04/bog_app/app/controllers/creatures_controller.rb

  def create
    @creature = Creature.create(creature_params)
---
INSERT INTO "creatures" ("name", "description", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "robohitler"], ["description", "self descriptive"], ["age", 90], ["created_at", "2016-02-19 05:11:18.181398"], ["updated_at", "2016-02-19 05:11:18.181398"]]

  def show
    id = params[:id]
    @creature = Creature.find(id)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 0]]

  def edit
    # id = params[:id]
    @creature = Creature.find(params[:id])
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 2]]

  def destroy
    Creature.destroy(params[:id])
---
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 4]]