FranchiniMae/w05/w05d03/bog_app/app/controllers/creatures_controller.rb

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Testing"], ["description", "Testing"], ["created_at", "2016-02-19 02:12:00.769086"], ["updated_at", "2016-02-19 02:12:00.769086"]]
---
	def create
		creature_params = params.require(:creature).permit(:name, :description)
		creature = Creature.new(creature_params)
		if creature.save

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		id = params[:id]
		@creature = Creature.find(id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]
---
	def edit
		id = params[:id]
		@creature = Creature.find(id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "creatures" SET "description" = $1, "updated_at" = $2 WHERE "creatures"."id" = $3  [["description", "Cool green little man"], ["updated_at", "2016-02-19 02:03:25.124845"], ["id", 1]]
---
	def update
		creature_id = params[:id]
		creature = Creature.find(creature_id)
		updated_attributes = params.require(:creature).permit(:name, :description)
		creature.update_attributes(updated_attributes)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 3]]
---
	def destroy
		id = params[:id]
		creature = Creature.find(id)
		creature.destroy