Jehnean/bog_app/app/controllers/creatures_controller.rb

SELECT "creatures".* FROM "creatures"
---
	def index
		#get all creatures from db and save to instance variable
		@creatures = Creature.all

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]
---
    def edit
        # save the id parameter to a variable
        id = params[:id]
        # look up the creature by id and save to an instance variable
        @creature = Creature.find(id)