takshingli810/w05/d04/app/controllers/creatures_controller.rb

  def index
    @creature = Creature.all
---
SELECT "creatures".* FROM "creatures"